'''
Напишите функцию, которая проверяет: является ли слово палиндромом

'''
def palindrome(s):
    if len(s) <=1: # пустая строка является палиндромом,так же и строка в один символ
        return True
    return s[0] == s[len(s) -1] and (s[1:len(s) - 1]) # слово можно считать палиндромом,
#  первый и последний символ одинаковый
def main():
    line = input('введите слово:')
    if palindrome(line):
        print('это палиндром:')
    else:
        print('это не палиндром:')
main()
